alplabai/gd32-bridge-firmware/hal/transport_hw_gd32.c
			dma_channel_disable(BRIDGE_SPI_DMA, BRIDGE_SPI_RX_DMA_CH);
			dma_channel_disable(BRIDGE_SPI_DMA, BRIDGE_SPI_TX_DMA_CH);

			rcu_periph_reset_enable(RCU_SPI1RST);
			rcu_periph_reset_disable(RCU_SPI1RST);
			bridge_spi_periph_config();

			/* Self-contained decode: reset the portable staging FIRST so a
             * swallowed falling edge cannot prepend the previous frame's
             * bytes to this one (see the handler comment). */
			spi_slave_cs_low();
			for (uint32_t i = 0; i < received; i++) {
				spi_slave_rx_byte(spi_rx_dma_buf[i]);
			}
			spi_slave_cs_high();

			uint32_t reply_len = 0;
			while (spi_slave_tx_pending() && (reply_len < BRIDGE_SPI_DMA_BUF_LEN)) {
				spi_tx_dma_buf[reply_len++] = spi_slave_tx_next_byte();
			}

			spi_dma_arm_rx();
			spi_dma_arm_tx(reply_len);
		}
	}
}

/* =================================================================== */
/* I2C slave bring-up                                                   */
/* =================================================================== */

static void i2c_gpio_init(void)
{
	const uint32_t af = BRIDGE_I2C_GPIO_AF;

	/* Open-drain; rely on the BRD_I2C bus pull-ups. */
	gpio_mode_set(BRIDGE_I2C_SCL_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, BRIDGE_I2C_SCL_PIN);
	gpio_mode_set(BRIDGE_I2C_SDA_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, BRIDGE_I2C_SDA_PIN);
	gpio_output_options_set(
	    BRIDGE_I2C_SCL_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_60MHZ, BRIDGE_I2C_SCL_PIN);
	gpio_output_options_set(
	    BRIDGE_I2C_SDA_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_60MHZ, BRIDGE_I2C_SDA_PIN);
	gpio_af_set(BRIDGE_I2C_SCL_PORT, af, BRIDGE_I2C_SCL_PIN);
	gpio_af_set(BRIDGE_I2C_SDA_PORT, af, BRIDGE_I2C_SDA_PIN);
}

/* I2C_TIMING (PSC/SCLDELY/SDADELY) fields are 4 bits each (UM Rev1.2
 * p.1287-1288) -- 0-15. */
#define I2C_TIMING_FIELD_MAX 15u

/* Fast-mode floor for the I2C kernel clock: Datasheet Rev2.0 p.141
 * Table 4-48, footnote (2), "To ensure the fast mode I2C frequency,
 * fPCLK1 must be at least 4 MHz."  BRIDGE_I2C_CK_SRC feeds I2C0 from
 * CK_APB1 (RCU_I2CSRC_APB1, hal/bridge_board_config.h), i.e. fPCLK1 IS
 * apb1_hz here -- this is the acceptable I2CCLK range's documented
 * floor. */
#define I2C_APB1_MIN_HZ_FAST_MODE 4000000u

/* Derive PSC/SCLDELY/SDADELY from the LIVE APB1 kernel clock (UM Rev1.2
 * p.1261 SS28.3.4 SCLDELY/SDADELY inequalities; Datasheet Rev2.0 p.141
 * Table 4-48 Fast-mode AC timing) rather than trusting a constant tied
 * to one clock configuration.
 *
 * Why this exists (gh#12, gh#38, gh#41): the Deep-sleep wake path
 * (hal/gd32/power.c) calls bridge_transport_i2c_hw_init() while CK_APB1
 * can still be running off ~8 MHz IRC8M -- UM Rev1.2 p.142, "Deep-sleep
 * mode": "all of IRC8M, HXTAL and PLL are disabled ... When exiting the
 * Deep-sleep mode, the IRC8M is selected as the system clock", and this
 * firmware has no PLL-relock step anywhere (gh#12, still open).  A PSC/
 * SCLDELY/SDADELY set computed for 216 MHz and reused verbatim at 8 MHz
 * (an earlier revision of this function did exactly that) makes tPSC
 * ~27x coarser than intended -- multiple microseconds of granularity
 * against sub-microsecond Fast-mode delay targets -- which is a real
 * synchronisation failure, not just imprecise timing.  Re-deriving from
 * the live clock on every call (what this function did before it was
 * replaced with fixed constants) fixes the wake path directly, because
 * the inequalities below are just as solvable at 8 MHz as at 216 MHz;
 * see the worked example below.
 *
 *   tI2CCLK = 1 / apb1_hz
 *   PSC: target ~8 MHz tick (apb1_hz/8MHz, clamped to the 4-bit field);
 *        a coarser divider keeps SCLDELY/SDADELY small at high apb1_hz
 *        instead of needing near-max field values.
 *   tPSC = (PSC+1) * tI2CCLK
 *   SCLDELY >= [tr(max)+tSU;DAT(min)] / tPSC - 1
 *   SDADELY >= {tf(max)+tHD;DAT(min)-tAF(min)-[(DNF+3)*tI2CCLK]} / tPSC
 *   (tAF(min) unspecified in either document, taken as 0 -- the
 *   conservative direction for a lower bound; DNF = 0000, the reset
 *   value, since I2C_CTL0's digital-filter field is never written; all
 *   Fast-mode column values from Datasheet Rev2.0 p.141 Table 4-48:
 *   tr(max)=300ns, tSU;DAT(min)=100ns, tf(max)=300ns, tHD;DAT(min)=0ns.)
 *
 *   At apb1_hz = 216,000,000 (this board's normal run clock): PSC=15,
 *   tPSC=74.07ns, SCLDELY=5, SDADELY=4 -- the exact constants this
 *   function hardcoded before, re-derived rather than assumed.
 *   At apb1_hz = 8,000,000 (IRC8M, the Deep-sleep wake case): PSC=0,
 *   tPSC=125ns, SCLDELY=3, SDADELY=0 -- all in range; the 216 MHz
 *   constants were never valid here, but a live re-derivation is.
 *
 * Returns false -- and leaves *psc, *scl_dely, *sda_dely untouched --
 * if apb1_hz is below the Fast-mode kernel-clock floor, or if the
 * derived fields would not fit their 4-bit registers (defensive: not
 * reachable at any clock this SoC can actually run I2C0's kernel from,
 * per the two data points above, but a mis-read RCU register must
 * refuse loudly, not silently clamp into a wrong-but-plausible value --
 * that silent-clamp failure mode is exactly what gh#38 fixed once
 * already, for PSC alone). */
static bool
i2c_timing_derive(uint32_t apb1_hz, uint32_t *psc, uint32_t *scl_dely, uint32_t *sda_dely)
{
	if (apb1_hz < I2C_APB1_MIN_HZ_FAST_MODE) {
		return false;
	}

	uint32_t p = apb1_hz / 8000000u;
	if (p > 0u) {
		p -= 1u;
	}
	if (p > I2C_TIMING_FIELD_MAX) {
		p = I2C_TIMING_FIELD_MAX;
	}

	/* Picosecond fixed-point: apb1_hz up to ~500 MHz and (p+1) <= 16
     * keep every intermediate well inside 64 bits. */
	const uint64_t t_i2cclk_ps = 1000000000000ULL / apb1_hz;
	const uint64_t t_psc_ps    = (uint64_t)(p + 1u) * t_i2cclk_ps;

	const uint64_t tr_max_ps      = 300000ULL;
	const uint64_t tsu_dat_min_ps = 100000ULL;
	const uint64_t tf_max_ps      = 300000ULL;
	const uint64_t dnf3_term_ps   = 3ULL * t_i2cclk_ps; /* (DNF+3)*tI2CCLK, DNF=0 */

	/* SCLDELY >= [tr(max)+tSU;DAT(min)]/tPSC - 1, ceiling division so
     * the inequality holds for the chosen integer field value. */
	const uint64_t scldely_q = (tr_max_ps + tsu_dat_min_ps + t_psc_ps - 1u) / t_psc_ps;
	const uint32_t scl       = (scldely_q > 0u) ? (uint32_t)(scldely_q - 1u) : 0u;

