alplabai/gd32-bridge-firmware/hal/transport_hw_gd32.c
	/* SDADELY >= {tf(max)-tAF(min)-[(DNF+3)*tI2CCLK]}/tPSC (tHD;DAT(min)=0
     * drops out).  Can go non-positive at a low enough apb1_hz once the
     * DNF term dominates -- SDADELY=0 satisfies that case. */
	uint32_t sda = 0u;
	if (tf_max_ps > dnf3_term_ps) {
		const uint64_t sdadely_num = tf_max_ps - dnf3_term_ps;
		sda                        = (uint32_t)((sdadely_num + t_psc_ps - 1u) / t_psc_ps);
	}

	if (p > I2C_TIMING_FIELD_MAX || scl > I2C_TIMING_FIELD_MAX || sda > I2C_TIMING_FIELD_MAX) {
		return false;
	}

	*psc      = p;
	*scl_dely = scl;
	*sda_dely = sda;
	return true;
}

int bridge_transport_i2c_hw_init(void)
{
	rcu_i2c_clock_config(BRIDGE_I2C_RCU_IDX, BRIDGE_I2C_CK_SRC);
	rcu_periph_clock_enable(BRIDGE_I2C_RCU);
	i2c_gpio_init();

	const uint32_t apb1_hz = rcu_clock_freq_get(CK_APB1);
	uint32_t       psc, scl_dely, sda_dely;
	uint16_t       stretch_timeout_reload;
	if (!i2c_timing_derive(apb1_hz, &psc, &scl_dely, &sda_dely) ||
	    !bridge_i2c_stretch_timeout_reload(apb1_hz, &stretch_timeout_reload)) {
		/* Refuse rather than clamp: no i2c_timing_config()/i2c_enable()
         * below, so I2C0 stays disabled and every access on the bus
         * gets a hard failure the host/analyser can see, instead of a
         * peripheral that answers with silently wrong timing.  See
         * i2c_timing_derive()'s banner (gh#12/gh#38/gh#41) for why a
         * silent clamp is exactly the defect this refusal avoids. */
		return BRIDGE_HW_ERR_RANGE;
	}
	i2c_timing_config(BRIDGE_I2C_PERIPH, psc, scl_dely, sda_dely);
	i2c_analog_noise_filter_enable(BRIDGE_I2C_PERIPH);

	/* UM Rev1.2 §28.3.9/§28.4.6: both counters use
	 * (reload + 1) * 2048 * tI2CCLK. A normal low-SCL timeout covers a
	 * continuously stretched clock; the extended counter covers cumulative
	 * slave extension. Program both before their enable bits lock the reload
	 * fields, then let the already-enabled ERRIE path clear TIMEOUT and
	 * resynchronise the framing. The manual specifies TIMEOUT as a flag, not
	 * an automatic slave abort or SCL release; a stalled pad needs an explicit
	 * disable/reinitialise recovery path, verified on silicon (#150). */
	i2c_bus_timeout_a_config(BRIDGE_I2C_PERIPH, stretch_timeout_reload);
	i2c_bus_timeout_b_config(BRIDGE_I2C_PERIPH, stretch_timeout_reload);
	i2c_clock_timeout_enable(BRIDGE_I2C_PERIPH);
	i2c_extented_clock_timeout_enable(BRIDGE_I2C_PERIPH);

	i2c_address_config(
	    BRIDGE_I2C_PERIPH, (uint32_t)GD32_BRIDGE_DEFAULT_I2C_ADDR << 1, I2C_ADDFORMAT_7BITS);
	i2c_stretch_scl_low_enable(BRIDGE_I2C_PERIPH);

	/* Address-match, receive, stop and error always on; the transmit
     * interrupt is enabled only while serving a read.
     *
     * I2C_INT_NACK is deliberately NOT in this mask (#128).  On this IP
     * NACK is gated by its own CTL0.NACKIE, which makes it an EVENT-line
     * source -- it raises I2C0_EV, not I2C0_ER.  The EV handler below has
     * no NACK arm, so the terminating NACK the master sends before STOP at
     * the end of EVERY read latched, was never cleared, and re-entered
     * BRIDGE_I2C_EV_HANDLER immediately and permanently at group priority
     * 2.  Base level never ran again: bridge_hw_dsp_pump() and
     * ota_erase_tick() (hal/gd32/init.c) both stall there, so a bound DSP
     * chain stops producing and an armed OTA erase stops advancing.
     *
     * The clear site that looked like it covered this is in
     * BRIDGE_I2C_ER_HANDLER, on a vector NACK never raises -- see the
     * comment there.
     *
     * A slave has nothing to do with a master's end-of-read NACK: it is
     * the normal, correct end of every read, not an error, and every
     * vendor slave example leaves it masked.  NACKF still SETS in I2C_STAT
     * with NACKIE clear, it just raises no interrupt; it is cleared at the
     * end of the transaction in the STPDET arm below so it cannot
     * accumulate across transfers. */
	i2c_interrupt_enable(BRIDGE_I2C_PERIPH,
	                     I2C_INT_ADDM | I2C_INT_RBNE | I2C_INT_STPDET | I2C_INT_ERR);
	nvic_irq_enable(BRIDGE_I2C_EV_IRQN, BRIDGE_I2C_IRQ_PRIO, BRIDGE_I2C_IRQ_SUBPRIO);
	nvic_irq_enable(BRIDGE_I2C_ER_IRQN, BRIDGE_I2C_IRQ_PRIO, BRIDGE_I2C_IRQ_SUBPRIO);

	i2c_enable(BRIDGE_I2C_PERIPH);
	return BRIDGE_HW_OK;
}

/* I2C0 event ISR: address match (direction-aware), RX during a write,
 * STOP, and TX during a read.
 *
 * STPDET is tested AHEAD of TI.  At the end of a normal read, the last
 * envelope byte drains I2C_TDATA (setting TI) and the master then NACKs
 * and issues STOP (setting STPDET) essentially back-to-back, so both
 * flags are typically pending together on the interrupt that follows.
 * Servicing STPDET first disables I2C_INT_TI before the TI arm below can
 * run, so no orphan byte is ever written into TDATA for a transaction
 * that has already stopped (see the TDATA-flush comment on the read arm
 * for what happens if one gets written anyway). */
void BRIDGE_I2C_EV_HANDLER(void)
{
	if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_ADDSEND)) {
		const bool is_transmitter = (RESET != i2c_flag_get(BRIDGE_I2C_PERIPH, I2C_FLAG_TR));
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_ADDSEND);
		if (is_transmitter) {
			/* Repeated-START read: flush TDATA FIRST -- a prior read
             * can leave an orphan byte behind (UM Rev1.2 p.1292: TBE,
             * bit 0 of I2C_STAT, is hardware-set when TDATA is empty
             * and is also software-writable to empty TDATA; it is NOT
             * one of the flags I2C_STATC can clear, see i2c_flag_clear()'s
             * documented argument list in the SPL, so this is a direct
             * write to I2C_STAT itself).  Without the flush, that orphan
             * is shifted out first on this read and displaces every
             * field of the reply envelope by one byte, permanently
             * failing the CRC the host recomputes.  Then make sure the
             * reply for the just-received write is staged, and start
             * clocking it out. */
			I2C_STAT(BRIDGE_I2C_PERIPH) |= I2C_STAT_TBE;
			(void)i2c_slave_write_end();
			i2c_interrupt_enable(BRIDGE_I2C_PERIPH, I2C_INT_TI);
		} else {
			i2c_slave_write_start();
		}
	} else if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_RBNE)) {
		i2c_slave_rx_byte((uint8_t)i2c_data_receive(BRIDGE_I2C_PERIPH));
	} else if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_STPDET)) {
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_STPDET);
		/* The master NACKs the last byte of every read before STOP, so
         * NACKF is routinely set here.  It raises no interrupt now that
         * NACKIE is masked (#128), but clear it at the transaction
         * boundary anyway so it never carries into the next transfer and
         * cannot be observed as a stale error by anything that starts
         * polling I2C_STAT later. */
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_NACK);
		i2c_interrupt_disable(BRIDGE_I2C_PERIPH, I2C_INT_TI);
		/* Belt-and-suspenders: flush here too, so a byte written by a
         * TI race that slipped in before this STPDET was serviced
         * cannot strand itself across into the next transaction. */
		I2C_STAT(BRIDGE_I2C_PERIPH) |= I2C_STAT_TBE;
		/* STOP after a write with no read: stage the reply so a later
         * separate read transaction can fetch it. */
		(void)i2c_slave_write_end();
	} else if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_TI)) {
		i2c_data_transmit(BRIDGE_I2C_PERIPH, i2c_slave_tx_next_byte());
	} else {
		/* Terminating arm (#128).  An ISR that can return having cleared
         * NOTHING is a latent permanent lockup regardless of which flag
         * caused it: the NVIC line stays asserted and the handler is
         * re-entered immediately, forever, at a priority that starves
         * base level.  That is exactly how the unmasked NACK behaved
         * before it was dropped from the enable mask, and nothing about
         * the shape was specific to NACK.
         *
         * ADDSEND, STPDET and TI cannot reach here -- the arms above test
         * them first -- and RBNE/TI are cleared by the data-register
         * access, not by a status write.  So the only software-clearable
         * flag that can land here today is NACK, and only if a future
         * change puts I2C_INT_NACK back in the enable mask.  Clearing it
         * unconditionally costs one register write on a path that should
         * never execute, and turns "someone re-enabled NACK" from a dead
         * bridge into a no-op. */
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_NACK);
	}
}

/* I2C0 error ISR: clear every bus error the enabled group (I2C_INT_ERR,
 * see bridge_transport_i2c_hw_init()) can raise, then resynchronise the
 * slave framing so the transport recovers instead of merely no longer
 * re-interrupting.  That is #7.
 *
 * LOSTARB is a master-mode condition and unreachable on this pure slave,
 * so it is not handled here.
 *
 * The NACK arm below is NOT what clears a NACK, and never was (#128).
 * NACK is gated by its own CTL0.NACKIE, which makes it an EVENT-line
 * source: it raises BRIDGE_I2C_EV_HANDLER and never this vector, so this
 * arm has never once executed for a NACK -- which is why "the NACK is
 * cleared somewhere" read as true on inspection and was false in
 * execution.  The terminating NACK of every read is handled by masking
 * NACKIE in bridge_transport_i2c_hw_init() and clearing NACKF at the
 * transaction boundary in the EV handler's STPDET arm above.  This arm
 * stays only as a cheap safety net in case a future part or vendor-header
 * revision routes NACKF differently. */
void BRIDGE_I2C_ER_HANDLER(void)
{
	const uint32_t stat      = I2C_STAT(BRIDGE_I2C_PERIPH); /* snapshot before clearing */
	bool           bus_error = false;

