alplabai/gd32-bridge-firmware/hal/transport_hw_gd32.c
	if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_NACK)) {
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_NACK);
	}
	if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_BERR)) {
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_BERR);
		bus_error = true;
	}
	if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_OUERR)) {
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_OUERR);
		bus_error = true;
	}
	if (RESET != i2c_interrupt_flag_get(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_TIMEOUT)) {
		/* A timeout leaves the request/reply framing untrustworthy even
		 * though the IP only exposes it as a status flag. Clear it and use
		 * the same portable-side resynchronisation as a bus error; otherwise
		 * the next address match can append to a transaction that timed out
		 * while this handler was pre-empted. */
		i2c_interrupt_flag_clear(BRIDGE_I2C_PERIPH, I2C_INT_FLAG_TIMEOUT);
		bus_error = true;
	}

	/* Catch-all: blanket-clear every software-clearable ERROR-domain
     * status bit the snapshot shows set -- the safety net for a source
     * this handler does not model by name (LOSTARB/PECERR/TIMEOUT/
     * SMBALT).  I2C_STATC mirrors I2C_STAT's bit positions (UM Rev1.2
     * p.1291-1292 vs p.1292-1293), so writing the snapshot masked to
     * these bits back into I2C_STATC clears exactly the set ones in one
     * access.  This must not be the only thing that keeps the vector
     * from level-holding; the explicit arms above are the contract.
     *
     * ADDSEND and STPDET are deliberately EXCLUDED from this mask, even
     * though UM p.1292-1293 lists them as clearable the same way.  Both
     * are EV-domain events (serviced by BRIDGE_I2C_EV_HANDLER, never
     * raised by anything this ER handler itself does), but I2C_STAT is
     * one shared register: if either was pending in the `stat` snapshot
     * above because the EV IRQ simply hadn't run yet, including them
     * here would clear them out from under BRIDGE_I2C_EV_HANDLER and
     * lose an address match or a STOP.  An earlier revision of this
     * mask included them and only held because BRIDGE_I2C_EV_IRQN (31)
     * sorts below BRIDGE_I2C_ER_IRQN (32) at the same NVIC priority
     * (hal/bridge_board_config.h) -- correct per the Cortex-M tie-break
     * rule (lower IRQn serviced first among equal-priority pendings),
     * but an unstated dependency an unrelated IRQn/priority change could
     * silently break.  Narrowing the mask to bits this handler actually
     * owns removes that dependency instead of merely documenting it. */
	I2C_STATC(BRIDGE_I2C_PERIPH) =
	    stat & (I2C_STAT_NACK | I2C_STAT_BERR | I2C_STAT_LOSTARB | I2C_STAT_OUERR |
	            I2C_STAT_PECERR | I2C_STAT_TIMEOUT | I2C_STAT_SMBALT);

	if (bus_error) {
		i2c_interrupt_disable(BRIDGE_I2C_PERIPH, I2C_INT_TI);
		i2c_slave_write_start();
		/* Drop the tx side too -- see i2c_slave_tx_abort()'s banner.
         * Without this a retried read resumes from (or exhausts past)
         * a half-consumed reply instead of getting a clean answer. */
		i2c_slave_tx_abort();
	}
}
